# Homework 18 by Polskoi Yuri

"""
Створити словник як ключ якого буде 6-ти значне число, а в якості значень кортеж що складається з 2-х елементів - ім'я (str), вік (int).
Зробити близько 5-6 елементів словника.
Записати цей словник на диск у json-файл.
"""

import json

input_data = {
    100001: ('Nicolas', 25),
    100002: ('Natali', 19),
    100003: ('Jack', 30),
    100004: ('Elon', 23),
    100005: ('Maria', 44),
    100006: ('Mark', 18)
}

with open('hw_18.json', 'w') as f:
    json.dump(input_data, f)

